# 4.9 Task Part 1

## This script will contain the following: 
1. Import Libraries and Data 
2. Cleaning Data
3. Combine Data sets

### Import Libraries and Data

In [1]:
#import Libraries 
 
import pandas as pd
import numpy as np 
import os

In [2]:
#Set Path 
path= r'C:\Users\hmaio\Documents\4.0 Instacart Project'

In [4]:
# Import Data 
ords_prods_merge = pd.read_pickle(os.path.join(path, '4.0 Data', 'Prepared Data', 'orders_products_updated.pkl'))
# Import Data 
df_customer = pd.read_csv(os.path.join(path, '4.0 Data', 'Original Data', 'customers.csv'))

### Cleaning Data

In [5]:
df_customer.shape

(206209, 10)

In [6]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
# renaming surnam to Last_Name
df_customer.rename(columns = {'Surnam': 'Last_Name'}, inplace=True)

In [16]:
# Renaming First Name to First_Name 
df_customer.rename(columns = {'First Name': 'First_Name'}, inplace=True)

In [17]:
# Renaming n_dependants to no_of_dependants
df_customer.rename(columns = {'n_dependants': 'no_of_dependants'}, inplace=True)

In [19]:
df_customer.head()

,user_id,First_Name,Last_Name,Gender,STATE,Age,date_joined,no_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
# Checking data types 

df_customer.dtypes

user_id              int64
First_Name          object
Last_Name           object
Gender              object
STATE               object
Age                  int64
date_joined         object
no_of_dependants     int64
fam_status          object
income               int64
dtype: object

In [22]:
# checking for mixed data

for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

First_Name

In [23]:
# Changing First_Name data type to be string
df_customer['First_Name'] = df_customer['First_Name'].astype('str')

In [24]:
# Retesting to check for mixed data 
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

In [25]:
# Checking for duplicates 
df_dups = df_customer[df_customer.duplicated()]

In [27]:
df_dups.head ()

Empty DataFrame
Columns: [user_id, First_Name, Last_Name, Gender, STATE, Age, date_joined, no_of_dependants, fam_status, income]
Index: []

In [30]:
#Checking for missing values 
df_customer.isnull().sum()

user_id             0
First_Name          0
Last_Name           0
Gender              0
STATE               0
Age                 0
date_joined         0
no_of_dependants    0
fam_status          0
income              0
dtype: int64

In [32]:
df_customer.shape

(206209, 10)

## Combining data sets

In [33]:
df_customer.head()

,user_id,First_Name,Last_Name,Gender,STATE,Age,date_joined,no_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [36]:
df_customer.shape

(206209, 10)

In [35]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,_merge,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spender_flag,median_days_since_order,frequency_flag
0,2398795,1,2,3,7,15.0,196,1,1,Soda,...,both,Mid-Range Product,Least busiest days,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
1,473747,1,3,3,12,21.0,196,1,1,Soda,...,both,Mid-Range Product,Least busiest days,Most orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
2,2254736,1,4,4,7,29.0,196,1,1,Soda,...,both,Mid-Range Product,Least busiest days,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
3,431534,1,5,4,15,28.0,196,1,1,Soda,...,both,Mid-Range Product,Least busiest days,Most orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer
4,3367565,1,6,2,7,19.0,196,1,1,Soda,...,both,Mid-Range Product,Regularly busy,Average orders,10,New customer,6.372222,Low spender,20.5,Non-frequent customer

In [37]:
ords_prods_merge.shape

(30328763, 23)

The common idenifier in both dataframes is user_id

In [39]:
#merge data
df_merged= df_customer.merge(ords_prods_merge, on = 'user_id')

In [40]:
# check merged data 
df_merged.shape

(30328763, 32)

In [41]:
df_merged.head()

,user_id,First_Name,Last_Name,Gender,STATE,Age,date_joined,no_of_dependants,fam_status,income,...,_merge,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spender_flag,median_days_since_order,frequency_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,both,Mid-Range Product,Busiest days,Average orders,8,New customer,8.205882,Low spender,19.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,both,Mid-Range Product,Regularly busy,Most orders,8,New customer,8.205882,Low spender,19.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,both,Mid-Range Product,Busiest days,Most orders,8,New customer,8.205882,Low spender,19.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,both,Mid-Range Product,Regularly busy,Average orders,8,New customer,8.205882,Low spender,19.0,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,both,Mid-Range Product,Least busiest days,Most orders,8,New customer,8.205882,Low spender,19.0,Regular customer

### Export Data

In [42]:
df_merged.to_pickle(os.path.join(path, '4.0 Data', 'Prepared Data', 'df_merged_final.pkl'))